
import './slider.css'
import { useAppSelector } from '../store/hooks'
import { motion } from "framer-motion";
import { useState } from 'react'

const Slider = () => {

  const theme = useAppSelector(state => state.Theme)
  const [flipped, setFlipped] = useState(false);

  return (
   <div className='slidesContainer' style={{borderBottom: '1px solid ' + theme.color}}>

     <div className='levelSlide' style={{border: '1px solid ' + theme.color, backgroundColor: theme.slideBackground}}>
      <div className='slideIcon'></div>
      <p className='slideText' style={{color: theme.color}}>
        <h1>Що потрібно знати для рівня A1</h1> 

        Для досягнення рівня A1 в англійській мові важливо засвоїти базові знання 
        та навички, які дозволять вам вести прості розмови та розуміти базові тексти. 
        Ось деякі ключові пункти, які потрібно знати:

        <ul>
          <li><h3>Алфавіт та вимова</h3>
          Розпізнавання літер англійського алфавіту та їх вимова.
          </li>
          <li><h3>Кольори та числа</h3>
          Знання та вміння називати кольори та числа.
          </li>
          <li><h3>Базові фрази для спілкування</h3>
          Вивчите, як вітатися та прощатися англійською мовою.
          </li>
          <li><h3>Коротка інформація про себе</h3>
          Вміння називати основні дані про себе, такі як ім’я, вік, місце проживання.
          </li>
          <li><h3>Коротка інформація про себе</h3>
          Вміння називати основні дані про себе, такі як ім’я, вік, місце проживання.
          </li>
          <li><h3>Коротка інформація про себе</h3>
          Вміння називати основні дані про себе, такі як ім’я, вік, місце проживання.
          </li>
          <li><h3>Сім’я</h3>
          Розуміння та вміння називати членів родини (батько, мати, брат, сестра тощо).
          </li>
          <li><h3>Знання базових слів та формування простих речень.</h3>
          Ви можете описати деякі предмети, щоденні дії або події, що минули та 
          розуміти прості речення та запитання від іноземців.
          </li>
        </ul>
      
        Ці базові знання та навички стануть основою для подальшого вивчення 
        англійської мови та розвитку рівня в майбутньому.
      </p>
     </div>

     <div className='levelSlide' style={{border: '1px solid ' + theme.color, backgroundColor: theme.slideBackground}}>
      <div className='slideIcon'></div>
      <p className='slideText' style={{color: theme.color}}>
        <h1>Що потрібно знати для рівня A2</h1> 
        На цьому рівні словниковий запас буде складати 1400-1800 слів. Рівень Pre-Intermediate, передбачає, що людина може спілкуватись з іноземцями на прості загальні теми такі, як:
        <ul>
         <li>
          <h3>Родина</h3>
          Слова для опису членів сім’ї (батько, мати, брат, сестра тощо) та звичайні фрази, пов’язані з родинними стосунками.
         </li>
         <li>
          <h3>Робота</h3>
          Лексика, пов’язана з робочими посадами, обов’язками та професіями.
         </li>
         <li>
          <h3>Дозвілля</h3>
          Слова, що описують розваги, хобі, спорт та інші види дозвілля (кіно, музика, читання книг тощо).
         </li>
         <li>
          <h3>Подорожі</h3>
          Лексика, необхідна для спілкування в готелях, аеропортах, на залізничних станціях, а також слова, пов’язані з транспортом та місцями для відпочинку.
         </li>
         <li>
          <h3>Їжа та напої</h3>
          Слова, що описують різні страви, харчові продукти, ресторани та кафе.</li>
         <li>
          <h3>Рутинні ситуації</h3>
          Лексика для опису рутинних дій та щоденних обов’язків (привітання, прохання, вибачення тощо).
         </li>
        </ul>
      
        Рівень Pre-Intermediate дає можливість використовувати англійську для базових комунікативних потреб
      </p>
     </div>

     <div className='levelSlide' style={{border: '1px solid ' + theme.color, backgroundColor: theme.slideBackground}}>
      <div className='slideIcon'></div>
      <p className='slideText' style={{color: theme.color}}>
        <h1>Що потрібно знати для рівня B1</h1> 
        B1 рівень англійської охоплює більш складні граматичні конструкції у 
        порівнянні з початковим рівнем. Основні аспекти граматики, які вивчаються:
        <ul>
        <li>
          <h3>Умовні речення</h3>
          Студенти вивчають різні типи умовних конструкцій. Вони навчаються вживати їх для вираження умов та їх можливих наслідків у майбутньому або у минулому.
        </li>
        <li>
          <h3>Складні форми дієслів</h3>
          Рівень Intermediate передбачає вивчення різних форм дієслів, такі як герундій, інфінітив та інші та їх використання в різних граматичних конструкціях.
        </li>
        <li>
          <h3>Непряма мова</h3>
          Учням розказують, як перекладати пряму мову (що була сказана відразу) у непряму. Таким чином можна відобразити сказане іншою людиною, але не дослівно.
        </li>
        <li>
          <h3>Пасивний стан</h3>
          Коли студенти вивчають рівень англійської B1, то зазвичай у навчальній програмі є уроки про Passive Voice. Учні дізнаються різницю між активним та пасивним станом та зміну у формі речення, де об’єкт виступає у ролі суб’єкта.
        </li>
        <li>
          <h3>Вивчення додаткових часів</h3>
          На цьому рівні студенти поглиблюють свої знання про вживання різних часів (наприклад, Present Continuous, Past Simple, Past Continuous, Future Simple, Present Perfect) у різних контекстах і ситуаціях.
        </li>
       
        </ul>
        Ці правила граматики допомагають студентам розширити свій лінгвістичний арсенал та зробити мовлення більш точним та виразним на Intermediate рівні. А наша школа англійської мови допоможе покращити ваші знання вже зараз. Записуйтесь на 1 безкоштовний урок та не відкладайте нові можливості на завтра.
      </p>
     </div>

     <div className='levelSlide' style={{border: '1px solid ' + theme.color, backgroundColor: theme.slideBackground}}>
      <div className='slideIcon'></div>
      <p className='slideText' style={{color: theme.color}}>
        <h1>Що потрібно знати для рівня B2</h1> 
        Upper Intermediate — це вже доволі велика база знань, коли студенти можуть спілкуватися чи писати іноземцям не стандартними простими фразами, а використовувати складні конструкції при комунікації. Коли вивчали рівень Intermediate В1, то вже знали більшість часів, умовні конструкції, пасивний стан та непряму мову. На B2 мають такі знання:
        <ul>
        <li>
          <h3>Модальні слова</h3>
          Учень правильно вживає модальні дієслова, такі як «can, «could», «may», «might», «might», «must», «shall», «should», «will», «would», «ought to», «need», «have to». Деякі з них можуть виражати різні ступені обов’язку, можливості та інші концепції.
        </li>
        <li>
          <h3>Фрази з дієсловами</h3>
          Потрібно розуміти різні контексти, в яких можна використовувати дієслова: «to have», «to be», «to do» у різних формах та сполученнях.
        </li>
        <li>
          <h3>Лексичні структури</h3>
          Вам необхідно мати великий запас лексики для різних тем і ситуацій, знати англійські ідіоми та їх переклад.
        </li>
        <li>
          <h3>Часи</h3>
          Вільне використання складних часів: Future Continuous, Future Perfect, Future Perfect Continuous, Past Perfect, Past Perfect Continuous та розуміння різниці між ними.
        </li>
        <li>
          <h3>Пасивний стан та умовні конструкції</h3>
          Студенти знають, як формуються ці конструкції та як їх використовувати в англійській.
        </li>
        <li>
          <h3>Словниковий запас для письма та читання</h3>
          Необхідно знати до 5000 слів, щоб розуміти тексти різної складності: художню літературу, новини, наукові тексти, рекламу ті інше.
        </li>
       
        </ul>

      </p>
     </div>

     <div className='levelSlide' style={{border: '1px solid ' + theme.color, backgroundColor: theme.slideBackground}}>
      <div className='slideIcon'></div>
      <p className='slideText' style={{color: theme.color}}>
      <h1>Що потрібно знати для рівня C1</h1> 
        Advanced рівень відкриває перед вами велику кількість можливостей:
        <ul>

          <li>
            <h3>Професійні переваги</h3>
            Вміння спілкуватися англійською на високому рівні дасть вам конкурентну перевагу на ринку праці. Ви зможете взаємодіяти з міжнародними колегами, клієнтами та партнерами.
          </li>

          <li>
            <h3>Можливості подорожей</h3>
            Розширить ваші можливості для подорожей та відпочинку. Ви зможете з легкістю спілкуватися з місцевими жителями та вільно пересуватися по англомовних країнах.
          </li>

          <li>
            <h3>Культурна інтеграція</h3>
            Ця іноземна мова відкриє для вас двері до культурного світу англомовних країн. Ви зможете насолоджуватися літературою, фільмами, музикою та іншими культурними артефактами без потреби перекладу
          </li>

          <li>
            <h3>Навчання та розвиток</h3>
            На рівні С1 ви зможете вивчати нові предмети та професійні курси англійською мовою, що відкриє перед вами нові можливості для особистого та професійного розвитку
          </li>

          <li>
            <h3>Соціальні контакти</h3>
            Дозволить вам легко встановлювати нові соціальні зв’язки та знайомства як у вашій країні, так і за її межами
          </li>
          <li>
            <h3>Саморозвиток</h3>
            Стимулює ваш інтелектуальний розвиток, покращує когнітивні функції та сприяє розвитку аналітичного мислення.
          </li>
          
        </ul>
      </p>
     </div>

     <div className='levelSlide' style={{border: '1px solid ' + theme.color, backgroundColor: theme.slideBackground}}>
      <div className='slideIcon'></div>
      <p className='slideText' style={{color: theme.color}}>
      <h1>Що потрібно знати для рівня C2</h1> 
      Для досягнення рівня Proficiency необхідно розуміти різницю між різними граматичними конструкціями та правильно їх використовувати. Деякі з найважливіших аспектів граматики для цього рівня
        <ul>

          <li>
            <h3>Всі часи</h3>
            Володіння всіма часами англійської мови, включаючи Present Perfect Continuous, Past Perfect Continuous, Future Perfect і всі їхні комбінації.
            By the time I finish this course, I will have been studying English for five years. — До того часу, як я закінчу цей курс, я вивчатиму англійську п’ять років.
          </li>
          <li>
            <h3>Умовні речення</h3>
            Застосування умовних конструкцій всіх типів, включно зі зворотним умовним.
            If I had known about the meeting, I would have attended. — Якби я знав про зустріч, я б взяв участь.
          </li>
          <li>
            <h3>Пасивний стан</h3>
            Здатність до використання та розуміння англійських пасивних конструкцій у всіх часах та аспектах.
            The book was written by a famous author. — Книгу написав відомий автор.
          </li>
          <li>
            <h3>Складні конструкції</h3>
            Використання складних конструкцій, таких як займенникові та прислівникові прикметники, порівняльні та високі ступені прикметників.
            The more I learn, the more I realize how much I still don’t know. — Чим більше я вчуся, тим більше розумію, скільки я все ще не знаю.
          </li>
          <li>
            <h3>Модальні дієслова</h3>
            Використання всіх модальних дієслів у всіх їхніх аспектах та контекстах. 
            You mustn’t smoke in here. It’s against the rules. — Ви не повинні курити тут. Це порушує правила.
          </li>
          <li>
            <h3>Вживання артиклів</h3>
            Використання артиклів (визначеного та невизначеного) з урахуванням їхніх відтінків значень та правил.
            I’d like to buy a car. — Я б хотів купити автомобіль.
          </li>
          <li>
            <h3>Фразові дієслова</h3>
            Розуміння та використання фразових дієслів у різних контекстах та їхніх значень.
            I need to look up this word in the dictionary. — Мені потрібно знайти це слово в словнику.
          </li>
          <li>
            <h3>Сполучники</h3>
            Використання різних типів сполучників для створення складних речень та переходів між ідеями.
            Although it was raining, we decided to go for a walk. — Хоча і йшов дощ, ми вирішили піти на прогулянку.
          </li>
          <li>
            <h3>Інфінітив та герундій</h3>
            Розуміння та правильне використання інфінітива та герундія в різних контекстах. 
            I enjoy playing tennis in my free time. — Я люблю грати у теніс у вільний час.
          </li>
          <li>
            <h3>Складні речення</h3>
            Здатність до створення складних речень з різними типами підрядних та безпосередніх об’єктів, а також залежних речень.
            Having finished her work, she went home. — Закінчивши свою роботу, вона пішла додому.
          </li>
          
        </ul>
      </p>
     </div>

     
   </div>

  )
}

export default Slider